Repository: autotools-mirror/m4
Catalog: po/*.po
Languages: nl, ru

source: %s: option `%s' is ambiguous
ru: %s: опция `%s' неоднозначна

source: %s: option `--%s' doesn't allow an argument
ru: %s: у опции `--%s' не должно быть аргументов

source: %s: option `%c%s' doesn't allow an argument
ru: %s: у опции `%c%s' не должно быть аргументов

source: %s: option `%s' requires an argument
ru: %s: у опции `%s' должен быть аргумент

source: %s: unrecognized option `--%s'
ru: %s: неизвестная опция `--%s'

source: %s: unrecognized option `%c%s'
ru: %s: неизвестная опция '%c%s'

source: %s: illegal option -- %c
ru: %s: запрещенная опция -- %c

source: %s: invalid option -- %c
ru: %s: неверная опция -- %c

source: %s: option requires an argument -- %c
ru: %s: опции необходим аргумент -- %c

source: Memory exhausted
ru: Память исчерпана

source: No previous regular expression
ru: Нет предшедствующего регулярного выражения

source: Undefined name %s
nl: Ongedefinieerde naam %s
ru: Имя %s неопределено

source: INTERNAL ERROR: Builtin not found in builtin table!
nl: INTERNE FOUT: Ingebouwde functie niet gevonden in functie tabel!
ru: ВНУТРЕННЯЯ ОШИБКА: Встроенная лексема не найдена!

source: INTERNAL ERROR: Bad token data type in m4_dumpdef ()
nl: INTERNE FOUT: Onjuist teken data type in m4_dumpdef ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный тип лексемы в m4_dumpdef ()

source: INTERNAL ERROR: Bad symbol type in m4_defn ()
nl: INTERNE FOUT: Onjuist symbool type in m4_defn ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный тип символа в m4_defn ()

source: Cannot open pipe to command `%s'
nl: Kan geen pijp openen voor commando `%s'
ru: Невозможно открыть канал для комманды '%s'

source: Radix in eval out of range (radix = %d)
nl: Radix in evaluatie buiten bereik (radix = %d)
ru: Радикс в выражении выходит за пределы (radix = %d)

source: Negative width to eval
nl: Negatieve breedte te evalueren
ru: Отрицательная ширина

source: Non-numeric argument to %s
nl: Niet numeriek argument voor %s
ru: Нечисловой аргумент для %s

source: Cannot undivert %s
ru: Невозможно вернуть вывод из %s

source: Cannot open %s
nl: Kan %s niet openen
ru: Невозможно открыть %s

source: Debugmode: bad debug flags: `%s'
nl: Debugmode: onjuiste debug vlaggen: `%s'
ru: Режим отладки: неверный флаг отладки: '%s'

source: Cannot set error file: %s
nl: Kan fout bestand niet instellen: %s
ru: Невозможно назначить файл ошибок %s

source: WARNING: \0 will disappear, use \& instead in replacements
nl: LET OP: \0 zal verdwijnen, gebruik hiervoor \& als vervanging
ru: ПРЕДУПРЕЖДЕНИЕ: \0 исчезнет, используйте \& в заменах

source: Bad regular expression `%s': %s
nl: Onjuiste reguliere expressie `%s': %s
ru: Неверное регулярное выражение: '%s': %s

source: Error matching regular expression `%s'
nl: Fout overeenkomen reguliere expressies `%s'
ru: Ошибка сопоставления регулярного выражения '%s'

source: INTERNAL ERROR: Builtin not found in builtin table! (trace_pre ())
nl: INTERNE FOUT: Ingebouwde functie niet gevonden in functie tabel! (trace_pre ())
ru: ВНУТРЕННЯЯ ОШИБКА: Встроенная лексема не найдена! (trace_pre ())

source: INTERNAL ERROR: Bad token data type (trace_pre ())
nl: INTERNE FOUT: Onjuiste teken data type (trace_pre ())
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный тип лексемы (trace_pre ())

source: Bad expression in eval (missing right parenthesis): %s
nl: Onjuiste expressie in evaluatie (ontbrekend rechter haakje): %s
ru: Неверное выражение (отсутствует правые скобки): %s

source: Bad expression in eval: %s
nl: Onjuist expressie in evaluatie: %s
ru: Неверное выражение: %s

source: Bad expression in eval (bad input): %s
nl: Onjuist expressie in evaluatie (onjuiste invoer): %s
ru: Неверное выражение (bad input): %s

source: Bad expression in eval (excess input): %s
nl: Onjuist expressie in evaluatie (te veel invoer): %s
ru: Неверное выражение (excess input): %s

source: Divide by zero in eval: %s
nl: Delen door nul in evaluatie: %s
ru: Деление на ноль в выражении: %s

source: Modulo by zero in eval: %s
nl: Modulo door nul in evaluatie: %s
ru: Модульное деление на ноль в выражении: %s

source: INTERNAL ERROR: Bad error code in evaluate ()
nl: INTERNE FOUT: Onjuiste fout code in evaluate ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный код ошибки в evaluate ()

source: INTERNAL ERROR: Bad comparison operator in cmp_term ()
nl: INTERNE FOUT: Onjuiste vergelijkings operator in cmp_term ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверное сравнение в cmp_term ()

source: INTERNAL ERROR: Bad shift operator in shift_term ()
nl: INTERNE FOUT: Onjuiste schuif operator in shift_term ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный оператор сдвига в shift_term ()

source: INTERNAL ERROR: Bad operator in mult_term ()
nl: INTERNE FOUT: Onjuiste operator in mult_term ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный оператор в mult_term ()

source: INTERNAL ERROR: Bad token data type in freeze_one_symbol ()
nl: INTERNE FOUT: Onjuist teken data type in freeze_one_symbol ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный тип лексемы в freeze_one_symbol ()

source: Expecting line feed in frozen file
nl: Verwacht nieuwe regel in gefixeerd bestand
ru: Ожидается перевод строки в файле-образе памяти

source: Expecting character `%c' in frozen file
nl: Verwacht karakter `%c' in gefixeerd bestand
ru: Ожидается символ '%c' в файле-образе памяти

source: Ill-formated frozen file
nl: Slecht geformateerd gefixeerd bestand
ru: Неверный формат файла-образа памяти

source: `%s' from frozen file not found in builtin table!
nl: `%s' van gefixeerd bestand niet gevonden in functie tabel!
ru: '%s' из файла-образа памяти не найдена во встроенной таблице!

source: Premature end of frozen file
nl: Voorbarig einde van gefixeerd bestand
ru: Преждевременный конец файла-образа памяти

source: Input reverted to %s, line %d
nl: Invoer reverted naar %s, lijn %d
ru: Ввод перенаправлен в %s , строка %d

source: Input read from %s
nl: Invoer gelezen vanuit %s
ru: Ввод из %s

source: INTERNAL ERROR: Recursive push_string!
nl: INTERNE FOUT: Recursieve push_string!
ru: ВНУТРЕННЯЯ ОШИБКА: Рекурсивная push_string!

source: INTERNAL ERROR: Bad call to init_macro_token ()
nl: INTERNE FOUT: Onjuiste aanroep naar init_macro_token ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный вызов init_macro_token ()

source: INTERNAL ERROR: Input stack botch in next_char ()
nl: INTERNE FOUT: Invoer stapel botch in next_char ()
ru: ВНУТРЕННЯЯ ОШИБКА: Ошибка входного стека в next_char ()

source: INTERNAL ERROR: Input stack botch in peek_input ()
nl: INTERNE FOUT: Invoer stapel botch in peek_input ()
ru: ВНУТРЕННЯЯ ОШИБКА: Ошибка входного стека в peek_input ()

source: NONE
nl: GEEN
ru: НИЧЕГО

source: Undefined syntax code %c
nl: Ongedefinieerde syntax code %c
ru: Неопределенный синтаксический код %c

source: ERROR: EOF in string
nl: FOUT: Einde van bestand teken in string
ru: ОШИБКА: Конец файла в строке

source: ERROR: Stack overflow. (Infinite define recursion?)
nl: FOUT: Stapel overflow. (Infinite define recursion?)
ru: ОШИБКА: Переполнение стека. (Бесконечное рекурсивное определение?)

source: Try `%s --help' for more information.
nl: Probeer `%s --help' voor meer informatie.
ru: Попробуйте '%s --help' для информации.

source: Usage: %s [OPTION]... [FILE]...
nl: Gebruik: %s [OPTIE]... [BESTAND]...
ru: Использование: %s [OPTION]... [FILE]...

source: Mandatory or optional arguments to long options are mandatory or optional for short options too. Operation modes: --help display this help and exit --version output version information and exit -e, --interactive unbuffer output, ignore interrupts -E, --fatal-warnings stop execution after first warning -Q, --quiet, --silent suppress some warnings for builtins -P, --prefix-builtins force a `m4_' prefix to all builtins
nl: Verplichte of optionele argumenten voor lange opties zijn ook verplicht of optioneel voor korte opties. Operatie modi: --help toon help tekst en beëindig programma --version toon versie informatie en beeindig programma -e, --interactive unbuffer output, negeer interrupts -E, --fatal-warnings stop uitvoering na eerste waarschuwing -Q, --quiet, --silent onderdruk sommige waarschuwingen voor ingebouwde functies -P, --prefix-builtins forceer een `m4_' voorvoegsel voor alle ingebouwde functies
ru: Обязательные или необязательные аргументы для длинных опции таковы и для коротких Режимы работы: --help показать помощь и выйти --version вывести информацию о версии и выйти -e, --interactive небуферизованный вывод, игнорировать прерывания -E, --fatal-warnings остановиться после первого предупреждения -Q, --quiet, --silent подавлять предупреждения для встроенных функций -P, --prefix-builtins добавлять префикс `m4_' для всех встроенных функций

source: -W, --word-regexp=REGEXP use REGEXP for macro name syntax
nl: -W, --word-regexp=REGEXP gebruik REGEXP voor macro naam syntax
ru: -W, --word-regexp=REGEXP использовать REGEXP для синтаксиса имен макросов

source: Preprocessor features: -I, --include=DIRECTORY search this directory second for includes -D, --define=NAME[=VALUE] enter NAME has having VALUE, or empty -U, --undefine=NAME delete builtin NAME -s, --synclines generate `#line NO "FILE"' lines
ru: Опции препроцессора: -I, --include=DIRECTORY искать в подкаталоге включаемые файлы -D, --define=NAME[=VALUE] определить, что NAME имеет VALUE, или пуст -U, --undefine=NAME удалить встроенную функцию NAME -s, --synclines генерировать строки `#line NO "FILE"'

source: Limits control: -G, --traditional suppress all GNU extensions -H, --hashsize=PRIME set symbol lookup hash table size -L, --nesting-limit=NUMBER change artificial nesting limit
nl: Limieten controlle: -G, --traditional onderdruk alle GNU uitbreidingen -H, --hashsize=PRIME stel symbolen opzoek hash tabel grootte -L, --nesting-limit=NUMBER verander kunstmatige nesting limiet
ru: Ограничения: -G, --traditional подавлять все GNU расширения -H, --hashsize=PRIME установить размер хэш-таблицы для поиска символов -L, --nesting-limit=NUMBER изменить предел глубины интелектуального поиска

source: Frozen state files: -F, --freeze-state=FILE produce a frozen state on FILE at end -R, --reload-state=FILE reload a frozen state from FILE at start
nl: Gefixeerd staat bestanden: -F, --freeze-state=FILE produceerd een gefixeerd staat van BESTAND aan het einde -R, --reload-state=FILE herlaad een gefixeerde staat van BESTAND aan het begin
ru: Блокированные файлы: -F, --freeze-state=FILE в конце создать образ памяти для FILE -R, --reload-state=FILE в начале загружать образ памяти для FILE

source: Debugging: -d, --debug=[FLAGS] set debug level (no FLAGS implies `aeq') -t, --trace=NAME trace NAME when it will be defined -l, --arglength=NUM restrict macro tracing size -o, --error-output=FILE redirect debug and trace output
nl: Debugging: -d, --debug=[VLAGGEN] stel debug nivo in (geen VLAGGEN impliceert `aeq') -t, --trace=NAAM traceer NAAM wanneer het wordt gedefinieerd -l, --arglength=NUM restrict macro traceer grootte -o, --error-output=FILE redirect debug en traceer uitvoer
ru: Отладка: -d, --debug=[FLAGS] установить уровень отладки (по умолчанию FLAGS=`aeq') -t, --trace=NAME трассировать NAME когда оно будет определено -l, --arglength=NUM установить размер трассировки для макроса -o, --error-output=FILE перенаправить отладочный и трассировочный вывод в файл FILE

source: FLAGS is any of: t trace for all macro calls, not only traceon'ed a show actual arguments e show expansion q quote values as necessary, with a or e flag c show before collect, after collect and after call x add a unique macro call id, useful with c flag f say current input file name l say current input line number p show results of path searches i show changes in input files V shorthand for all of the above flags
nl: VLAG is een van: t traceer voor alle macro aanroepen, niet alleen `traceon'ed a toon huidige argumenten e toon expansie q quote values as necessary, with a or e flag c show before collect, after collect and after call x add a unique macro call id, useful with c flag f say current input file name l say current input line number p show results of path searches i show changes in input files V shorthand for all of the above flags
ru: FLAGS is any of: t трассировать все вызовы макросов a показать текущие аргументы e показывать макрорасширение q заключать значения в кавычки по необходимости, с a или e флагами c показывать перед сбором , после сбора и после вызова x добавлять уникальный идентификатор вызова макроса, используется вместе с флагом c f выводить текущее имя входного файла l выводить номер текущей строчки p показывать результаты поиска по путям i показывать изменения во входных файлах V сокращение для всех флагов вместе

source: If no FILE or if FILE is `-', standard input is read.
nl: Als geen BESTAND of als BESTAND `-' is, standaard invoer wordt gelezen.
ru: Если FILE не существует или FILE это `-', используется стандартный вход.

source: Report bugs to <bug-m4@gnu.org>.
ru: Посылайте отчеты об ошибках на <bug-m4@gnu.org>.

source: Bad debug flags: `%s'
nl: Onjuiste debug vlaggen: `%s'
ru: Неверный флаг отладки: '%s'

source: (options:
ru: (ключи:

source: INTERNAL ERROR: Bad code in deferred arguments
nl: INTERNE FOUT: Onjuiste code in afgeleide argumenten
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный код в косвенных аргументах

source: INTERNAL ERROR: Bad token type in expand_token ()
nl: INTERNE FOUT: Onjuist teken type in expand_token ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный тип лексемы в expand_token ()

source: ERROR: EOF in argument list
nl: FOUT: Einde van bestand teken in argumentenlijst
ru: ОШИБКА: Конец файла в списке аргументов

source: INTERNAL ERROR: Bad token type in expand_argument ()
nl: INTERNE FOUT: Onjuist teken type in expand_argument ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный тип лексемы в expand_argument ()

source: INTERNAL ERROR: Bad symbol type in call_macro ()
nl: INTERNE FOUT: Onjuist symbool type in call_macro ()
ru: ВНУТРЕННЯЯ ОШИБКА: Неверный тип символа в call_macro ()

source: ERROR: Recursion limit of %d exceeded, use -L<N> to change it
nl: FOUT: Recursie limiet of %d overschreden, gebruik -L<N> om dit te wijzigen
ru: ОШИБКА: Лимит рекурсии %d исчерпан, используйте -L<N> чтобы изменить его

source: ERROR: Cannot create temporary file for diversion
nl: FOUT: Kan geen tijdelijk bestand aanmaken voor diversion
ru: ОШИБКА: Ошибка создания временного файла для разветвления макрообработки

source: ERROR: Cannot flush diversion to temporary file
nl: FOUT: Kan diversion niet flushen naar tijdelijk bestand
ru: ОШИБКА: Ошибка записи разветвления во временный файл

source: ERROR: Copying inserted file
nl: FOUT: Kopieren ingevoegde bestanden
ru: ОШИБКА: Копирую вставленный файл

source: ERROR: Reading inserted file
nl: FOUT: Lezen ingevoegd bestand
ru: ОШИБКА: Читаю вставленный файл

source: Cannot stat diversion
ru: Невозможно подсчитать разветвления

source: Path search for `%s' found `%s'
nl: Zoeken naar `%s' via PATH levert `%s'
ru: Путь поиска для `%s' найден `%s'

source: VMEM limit exceeded?
nl: VMEM limiet overschreden?
ru: Кончилась виртуальная память?

source: Memory bounds violation detected (SIGSEGV). Either a stack overflow occurred, or there is a bug in
nl: Geheugen bounds violation gedetecteerd (SIGSEGV). Een stack overflow is opgetreden, of er is een fout in
ru: Обнаружен выход за границу памяти (SIGSEGV). Это либо переполнение стека или ошибка в

source: . Check for possible infinite recursion.
nl: . Kontroleer voor mogelijk oneindige recusie.
ru: . Проверка на возможную бесконечную рекурсию.

source: INTERNAL ERROR: Illegal mode to symbol_lookup ()
nl: INTERNE FOUT: Ongeldige mode voor symbol_lookup ()
ru: ВНУТРЕННЯЯ ОШИБКА: неверный режим для symbol_lookup ()

source: Name `%s' is unknown
nl: Naam `%s' is niet bekend
ru: Имя `%s' неизвестно

source: Warning: Too few arguments to built-in `%s'
nl: Let op: Te weinig argument voor ingebouwde functie `%s'

source: Warning: Excess arguments to built-in `%s' ignored
nl: Let op: Overbodige argumenten voor ingebouwde functie `%s' worden genegeerd

source: Non-numeric argument to built-in `%s'
nl: Niet numeriek argument voor ingebouwde functie `%s'

source: INTERNAL ERROR: Bad token data type in define_macro ()
nl: INTERNE FOUT: Onjuist teken data type in define_macro ()

source: INTERNAL ERROR: Built-in not found in builtin table!
nl: INTERNE FOUT: Ingebouwde functie niet gevonden in functie tabel!
